In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
# Create a new series
series = Series(np.arange(4),index=['a','b','c','d'])
series

a    0
b    1
c    2
d    3
dtype: int64

In [10]:
# Drop an entry by index
series.drop('c')

a    0
b    1
d    3
dtype: int64

In [14]:
# Create a new Data Frame
df = DataFrame(np.arange(9).reshape((3,3)),columns=['# of Students', 'Average GPA', 'Endowment'],index=['Rice', 'Stanford', 'MIT'])
df

          # of Students  Average GPA  Endowment
Rice                  0            1          2
Stanford              3            4          5
MIT                   6            7          8

In [16]:
# Drop a row
df.drop("MIT")

          # of Students  Average GPA  Endowment
Rice                  0            1          2
Stanford              3            4          5

In [17]:
# Drop a column
df.drop('Average GPA', axis=1)

          # of Students  Endowment
Rice                  0          2
Stanford              3          5
MIT                   6          8